In [38]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [3]:
obj = Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4,7,-5,3],index=['d','a','b','c'])
obj2

d    4
a    7
b   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'a', 'b', 'c'], dtype='object')

In [9]:
obj2['a']

7

In [11]:
obj2[['a','b','c']]

a    7
b   -5
c    3
dtype: int64

In [13]:
obj2[obj2>0] #筛选

d    4
a    7
c    3
dtype: int64

In [14]:
'b' in obj2

True

In [15]:
'e' in obj2 #查找

False

In [16]:
sdata = {'Ohio':35000,'Texas':71000,'Oregen':16000,'Utah':5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregen    16000
Utah       5000
dtype: int64

In [17]:
states = ['California','Ohio','Oregen','Texas']
obj4 = Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregen        16000.0
Texas         71000.0
dtype: float64

In [19]:
pd.isnull(obj4) #检测缺失数据

California     True
Ohio          False
Oregen        False
Texas         False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Ohio           True
Oregen         True
Texas          True
dtype: bool

In [22]:
#DataFrame
data = {'state':['California','Ohio','Oregen','Texas'],'year':[2000,2001,2001,2003],'pop':[1.0,1.5,1.6,1.7]}

In [23]:
frame = DataFrame(data)
frame

        state  year  pop
0  California  2000  1.0
1        Ohio  2001  1.5
2      Oregen  2001  1.6
3       Texas  2003  1.7

In [24]:
DataFrame(data,columns=['year','pop','state'])

   year  pop       state
0  2000  1.0  California
1  2001  1.5        Ohio
2  2001  1.6      Oregen
3  2003  1.7       Texas

In [28]:
frame2 = DataFrame(data,columns=['year','pop','state','debt'],index=['one','two','three','four'])
frame2

       year  pop       state debt
one    2000  1.0  California  NaN
two    2001  1.5        Ohio  NaN
three  2001  1.6      Oregen  NaN
four   2003  1.7       Texas  NaN

In [29]:
frame2.columns

Index(['year', 'pop', 'state', 'debt'], dtype='object')

In [31]:
frame2['year']

one      2000
two      2001
three    2001
four     2003
Name: year, dtype: int64

In [32]:
frame2.year

one      2000
two      2001
three    2001
four     2003
Name: year, dtype: int64

In [34]:
frame2.loc['two'] #基于label定位行

year     2001
pop       1.5
state    Ohio
debt      NaN
Name: two, dtype: object

In [35]:
frame2.iloc[0] #基于行号定位行

year           2000
pop               1
state    California
debt            NaN
Name: one, dtype: object

In [36]:
frame2['debt']=16.5
frame2

       year  pop       state  debt
one    2000  1.0  California  16.5
two    2001  1.5        Ohio  16.5
three  2001  1.6      Oregen  16.5
four   2003  1.7       Texas  16.5

In [41]:
frame2['debt'] = np.arange(4)
frame2

       year  pop       state  debt
one    2000  1.0  California     0
two    2001  1.5        Ohio     1
three  2001  1.6      Oregen     2
four   2003  1.7       Texas     3

In [42]:
frame2['eastern'] = frame2.state=='Ohio'
frame2

       year  pop       state  debt  eastern
one    2000  1.0  California     0    False
two    2001  1.5        Ohio     1     True
three  2001  1.6      Oregen     2    False
four   2003  1.7       Texas     3    False

In [43]:
del frame2['eastern']
frame2

       year  pop       state  debt
one    2000  1.0  California     0
two    2001  1.5        Ohio     1
three  2001  1.6      Oregen     2
four   2003  1.7       Texas     3